steup/contiki/cpu/arm/atsam3s4/ATSAM3S4_map.h
/*----------------------------------------------------------------------------*/


/******************  Bit definition for AFIO_EVCR register  *******************/
#define AFIO_EVCR_PIN                        ((u8)0x0F)               /* PIN[3:0] bits (Pin selection) */
#define AFIO_EVCR_PIN_0                      ((u8)0x01)               /* Bit 0 */
#define AFIO_EVCR_PIN_1                      ((u8)0x02)               /* Bit 1 */
#define AFIO_EVCR_PIN_2                      ((u8)0x04)               /* Bit 2 */
#define AFIO_EVCR_PIN_3                      ((u8)0x08)               /* Bit 3 */

/* PIN configuration */
#define AFIO_EVCR_PIN_PX0                    ((u8)0x00)               /* Pin 0 selected */
#define AFIO_EVCR_PIN_PX1                    ((u8)0x01)               /* Pin 1 selected */
#define AFIO_EVCR_PIN_PX2                    ((u8)0x02)               /* Pin 2 selected */
#define AFIO_EVCR_PIN_PX3                    ((u8)0x03)               /* Pin 3 selected */
#define AFIO_EVCR_PIN_PX4                    ((u8)0x04)               /* Pin 4 selected */
#define AFIO_EVCR_PIN_PX5                    ((u8)0x05)               /* Pin 5 selected */
#define AFIO_EVCR_PIN_PX6                    ((u8)0x06)               /* Pin 6 selected */
#define AFIO_EVCR_PIN_PX7                    ((u8)0x07)               /* Pin 7 selected */
#define AFIO_EVCR_PIN_PX8                    ((u8)0x08)               /* Pin 8 selected */
#define AFIO_EVCR_PIN_PX9                    ((u8)0x09)               /* Pin 9 selected */
#define AFIO_EVCR_PIN_PX10                   ((u8)0x0A)               /* Pin 10 selected */
#define AFIO_EVCR_PIN_PX11                   ((u8)0x0B)               /* Pin 11 selected */
#define AFIO_EVCR_PIN_PX12                   ((u8)0x0C)               /* Pin 12 selected */
#define AFIO_EVCR_PIN_PX13                   ((u8)0x0D)               /* Pin 13 selected */
#define AFIO_EVCR_PIN_PX14                   ((u8)0x0E)               /* Pin 14 selected */
#define AFIO_EVCR_PIN_PX15                   ((u8)0x0F)               /* Pin 15 selected */

#define AFIO_EVCR_PORT                       ((u8)0x70)               /* PORT[2:0] bits (Port selection) */
#define AFIO_EVCR_PORT_0                     ((u8)0x10)               /* Bit 0 */
#define AFIO_EVCR_PORT_1                     ((u8)0x20)               /* Bit 1 */
#define AFIO_EVCR_PORT_2                     ((u8)0x40)               /* Bit 2 */

/* PORT configuration */
#define AFIO_EVCR_PORT_PA                    ((u8)0x00)               /* Port A selected */
#define AFIO_EVCR_PORT_PB                    ((u8)0x10)               /* Port B selected */
#define AFIO_EVCR_PORT_PC                    ((u8)0x20)               /* Port C selected */
#define AFIO_EVCR_PORT_PD                    ((u8)0x30)               /* Port D selected */
#define AFIO_EVCR_PORT_PE                    ((u8)0x40)               /* Port E selected */

#define AFIO_EVCR_EVOE                       ((u8)0x80)               /* Event Output Enable */


/******************  Bit definition for AFIO_MAPR register  *******************/
#define AFIO_MAPR_SPI1 _REMAP                ((u32)0x00000001)        /* SPI1 remapping */
#define AFIO_MAPR_I2C1_REMAP                 ((u32)0x00000002)        /* I2C1 remapping */
#define AFIO_MAPR_USART1_REMAP               ((u32)0x00000004)        /* USART1 remapping */
#define AFIO_MAPR_USART2_REMAP               ((u32)0x00000008)        /* USART2 remapping */

#define AFIO_MAPR_USART3_REMAP               ((u32)0x00000030)        /* USART3_REMAP[1:0] bits (USART3 remapping) */
#define AFIO_MAPR_USART3_REMAP_0             ((u32)0x00000010)        /* Bit 0 */
#define AFIO_MAPR_USART3_REMAP_1             ((u32)0x00000020)        /* Bit 1 */

/* USART3_REMAP configuration */
#define AFIO_MAPR_USART3_REMAP_NOREMAP       ((u32)0x00000000)        /* No remap (TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14) */
#define AFIO_MAPR_USART3_REMAP_PARTIALREMAP  ((u32)0x00000010)        /* Partial remap (TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14) */
#define AFIO_MAPR_USART3_REMAP_FULLREMAP     ((u32)0x00000030)        /* Full remap (TX/PD8, RX/PD9, CK/PD10, CTS/PD11, RTS/PD12) */

#define AFIO_MAPR_TIM1_REMAP                 ((u32)0x000000C0)        /* TIM1_REMAP[1:0] bits (TIM1 remapping) */
#define AFIO_MAPR_TIM1_REMAP_0               ((u32)0x00000040)        /* Bit 0 */
#define AFIO_MAPR_TIM1_REMAP_1               ((u32)0x00000080)        /* Bit 1 */

/* TIM1_REMAP configuration */
#define AFIO_MAPR_TIM1_REMAP_NOREMAP         ((u32)0x00000000)        /* No remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PB12, CH1N/PB13, CH2N/PB14, CH3N/PB15) */
#define AFIO_MAPR_TIM1_REMAP_PARTIALREMAP    ((u32)0x00000040)        /* Partial remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PA6, CH1N/PA7, CH2N/PB0, CH3N/PB1) */
#define AFIO_MAPR_TIM1_REMAP_FULLREMAP       ((u32)0x000000C0)        /* Full remap (ETR/PE7, CH1/PE9, CH2/PE11, CH3/PE13, CH4/PE14, BKIN/PE15, CH1N/PE8, CH2N/PE10, CH3N/PE12) */

#define AFIO_MAPR_TIM2_REMAP                 ((u32)0x00000300)        /* TIM2_REMAP[1:0] bits (TIM2 remapping) */
#define AFIO_MAPR_TIM2_REMAP_0               ((u32)0x00000100)        /* Bit 0 */
#define AFIO_MAPR_TIM2_REMAP_1               ((u32)0x00000200)        /* Bit 1 */

/* TIM2_REMAP configuration */
#define AFIO_MAPR_TIM2_REMAP_NOREMAP         ((u32)0x00000000)        /* No remap (CH1/ETR/PA0, CH2/PA1, CH3/PA2, CH4/PA3) */
#define AFIO_MAPR_TIM2_REMAP_PARTIALREMAP1   ((u32)0x00000100)        /* Partial remap (CH1/ETR/PA15, CH2/PB3, CH3/PA2, CH4/PA3) */
#define AFIO_MAPR_TIM2_REMAP_PARTIALREMAP2   ((u32)0x00000200)        /* Partial remap (CH1/ETR/PA0, CH2/PA1, CH3/PB10, CH4/PB11) */
#define AFIO_MAPR_TIM2_REMAP_FULLREMAP       ((u32)0x00000300)        /* Full remap (CH1/ETR/PA15, CH2/PB3, CH3/PB10, CH4/PB11) */

#define AFIO_MAPR_TIM3_REMAP                 ((u32)0x00000C00)        /* TIM3_REMAP[1:0] bits (TIM3 remapping) */
#define AFIO_MAPR_TIM3_REMAP_0               ((u32)0x00000400)        /* Bit 0 */
#define AFIO_MAPR_TIM3_REMAP_1               ((u32)0x00000800)        /* Bit 1 */

/* TIM3_REMAP configuration */
#define AFIO_MAPR_TIM3_REMAP_NOREMAP         ((u32)0x00000000)        /* No remap (CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1) */
#define AFIO_MAPR_TIM3_REMAP_PARTIALREMAP    ((u32)0x00000800)        /* Partial remap (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1) */
#define AFIO_MAPR_TIM3_REMAP_FULLREMAP       ((u32)0x00000C00)        /* Full remap (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9) */

#define AFIO_MAPR_TIM4_REMAP                 ((u32)0x00001000)        /* Port D0/Port D1 mapping on OSC_IN/OSC_OUT */

#define AFIO_MAPR_CAN_REMAP                  ((u32)0x00006000)        /* CAN_REMAP[1:0] bits (CAN Alternate function remapping) */
#define AFIO_MAPR_CAN_REMAP_0                ((u32)0x00002000)        /* Bit 0 */
#define AFIO_MAPR_CAN_REMAP_1                ((u32)0x00004000)        /* Bit 1 */

