steup/contiki/cpu/arm/atsam3s4/ATSAM3S4_map.h
/******************  Bit definition for NVIC_ICER register  *******************/
#define  NVIC_ICER_CLRENA                   ((u32)0xFFFFFFFF)        /* Interrupt clear-enable bits */
#define  NVIC_ICER_CLRENA_0                  ((u32)0x00000001)        /* bit 0 */
#define  NVIC_ICER_CLRENA_1                  ((u32)0x00000002)        /* bit 1 */
#define  NVIC_ICER_CLRENA_2                  ((u32)0x00000004)        /* bit 2 */
#define  NVIC_ICER_CLRENA_3                  ((u32)0x00000008)        /* bit 3 */
#define  NVIC_ICER_CLRENA_4                  ((u32)0x00000010)        /* bit 4 */
#define  NVIC_ICER_CLRENA_5                  ((u32)0x00000020)        /* bit 5 */
#define  NVIC_ICER_CLRENA_6                  ((u32)0x00000040)        /* bit 6 */
#define  NVIC_ICER_CLRENA_7                  ((u32)0x00000080)        /* bit 7 */
#define  NVIC_ICER_CLRENA_8                  ((u32)0x00000100)        /* bit 8 */
#define  NVIC_ICER_CLRENA_9                  ((u32)0x00000200)        /* bit 9 */
#define  NVIC_ICER_CLRENA_10                 ((u32)0x00000400)        /* bit 10 */
#define  NVIC_ICER_CLRENA_11                 ((u32)0x00000800)        /* bit 11 */
#define  NVIC_ICER_CLRENA_12                 ((u32)0x00001000)        /* bit 12 */
#define  NVIC_ICER_CLRENA_13                 ((u32)0x00002000)        /* bit 13 */
#define  NVIC_ICER_CLRENA_14                 ((u32)0x00004000)        /* bit 14 */
#define  NVIC_ICER_CLRENA_15                 ((u32)0x00008000)        /* bit 15 */
#define  NVIC_ICER_CLRENA_16                 ((u32)0x00010000)        /* bit 16 */
#define  NVIC_ICER_CLRENA_17                 ((u32)0x00020000)        /* bit 17 */
#define  NVIC_ICER_CLRENA_18                 ((u32)0x00040000)        /* bit 18 */
#define  NVIC_ICER_CLRENA_19                 ((u32)0x00080000)        /* bit 19 */
#define  NVIC_ICER_CLRENA_20                 ((u32)0x00100000)        /* bit 20 */
#define  NVIC_ICER_CLRENA_21                 ((u32)0x00200000)        /* bit 21 */
#define  NVIC_ICER_CLRENA_22                 ((u32)0x00400000)        /* bit 22 */
#define  NVIC_ICER_CLRENA_23                 ((u32)0x00800000)        /* bit 23 */
#define  NVIC_ICER_CLRENA_24                 ((u32)0x01000000)        /* bit 24 */
#define  NVIC_ICER_CLRENA_25                 ((u32)0x02000000)        /* bit 25 */
#define  NVIC_ICER_CLRENA_26                 ((u32)0x04000000)        /* bit 26 */
#define  NVIC_ICER_CLRENA_27                 ((u32)0x08000000)        /* bit 27 */
#define  NVIC_ICER_CLRENA_28                 ((u32)0x10000000)        /* bit 28 */
#define  NVIC_ICER_CLRENA_29                 ((u32)0x20000000)        /* bit 29 */
#define  NVIC_ICER_CLRENA_30                 ((u32)0x40000000)        /* bit 30 */
#define  NVIC_ICER_CLRENA_31                 ((u32)0x80000000)        /* bit 31 */


/******************  Bit definition for NVIC_ISPR register  *******************/
#define  NVIC_ISPR_SETPEND                   ((u32)0xFFFFFFFF)        /* Interrupt set-pending bits */
#define  NVIC_ISPR_SETPEND_0                 ((u32)0x00000001)        /* bit 0 */
#define  NVIC_ISPR_SETPEND_1                 ((u32)0x00000002)        /* bit 1 */
#define  NVIC_ISPR_SETPEND_2                 ((u32)0x00000004)        /* bit 2 */
#define  NVIC_ISPR_SETPEND_3                 ((u32)0x00000008)        /* bit 3 */
#define  NVIC_ISPR_SETPEND_4                 ((u32)0x00000010)        /* bit 4 */
#define  NVIC_ISPR_SETPEND_5                 ((u32)0x00000020)        /* bit 5 */
#define  NVIC_ISPR_SETPEND_6                 ((u32)0x00000040)        /* bit 6 */
#define  NVIC_ISPR_SETPEND_7                 ((u32)0x00000080)        /* bit 7 */
#define  NVIC_ISPR_SETPEND_8                 ((u32)0x00000100)        /* bit 8 */
#define  NVIC_ISPR_SETPEND_9                 ((u32)0x00000200)        /* bit 9 */
#define  NVIC_ISPR_SETPEND_10                ((u32)0x00000400)        /* bit 10 */
#define  NVIC_ISPR_SETPEND_11                ((u32)0x00000800)        /* bit 11 */
#define  NVIC_ISPR_SETPEND_12                ((u32)0x00001000)        /* bit 12 */
#define  NVIC_ISPR_SETPEND_13                ((u32)0x00002000)        /* bit 13 */
#define  NVIC_ISPR_SETPEND_14                ((u32)0x00004000)        /* bit 14 */
#define  NVIC_ISPR_SETPEND_15                ((u32)0x00008000)        /* bit 15 */
#define  NVIC_ISPR_SETPEND_16                ((u32)0x00010000)        /* bit 16 */
#define  NVIC_ISPR_SETPEND_17                ((u32)0x00020000)        /* bit 17 */
#define  NVIC_ISPR_SETPEND_18                ((u32)0x00040000)        /* bit 18 */
#define  NVIC_ISPR_SETPEND_19                ((u32)0x00080000)        /* bit 19 */
#define  NVIC_ISPR_SETPEND_20                ((u32)0x00100000)        /* bit 20 */
#define  NVIC_ISPR_SETPEND_21                ((u32)0x00200000)        /* bit 21 */
#define  NVIC_ISPR_SETPEND_22                ((u32)0x00400000)        /* bit 22 */
#define  NVIC_ISPR_SETPEND_23                ((u32)0x00800000)        /* bit 23 */
#define  NVIC_ISPR_SETPEND_24                ((u32)0x01000000)        /* bit 24 */
#define  NVIC_ISPR_SETPEND_25                ((u32)0x02000000)        /* bit 25 */
#define  NVIC_ISPR_SETPEND_26                ((u32)0x04000000)        /* bit 26 */
#define  NVIC_ISPR_SETPEND_27                ((u32)0x08000000)        /* bit 27 */
#define  NVIC_ISPR_SETPEND_28                ((u32)0x10000000)        /* bit 28 */
#define  NVIC_ISPR_SETPEND_29                ((u32)0x20000000)        /* bit 29 */
#define  NVIC_ISPR_SETPEND_30                ((u32)0x40000000)        /* bit 30 */
#define  NVIC_ISPR_SETPEND_31                ((u32)0x80000000)        /* bit 31 */


/******************  Bit definition for NVIC_ICPR register  *******************/
#define  NVIC_ICPR_CLRPEND                   ((u32)0xFFFFFFFF)        /* Interrupt clear-pending bits */
#define  NVIC_ICPR_CLRPEND_0                 ((u32)0x00000001)        /* bit 0 */
#define  NVIC_ICPR_CLRPEND_1                 ((u32)0x00000002)        /* bit 1 */
#define  NVIC_ICPR_CLRPEND_2                 ((u32)0x00000004)        /* bit 2 */
#define  NVIC_ICPR_CLRPEND_3                 ((u32)0x00000008)        /* bit 3 */
#define  NVIC_ICPR_CLRPEND_4                 ((u32)0x00000010)        /* bit 4 */
#define  NVIC_ICPR_CLRPEND_5                 ((u32)0x00000020)        /* bit 5 */
#define  NVIC_ICPR_CLRPEND_6                 ((u32)0x00000040)        /* bit 6 */
#define  NVIC_ICPR_CLRPEND_7                 ((u32)0x00000080)        /* bit 7 */
#define  NVIC_ICPR_CLRPEND_8                 ((u32)0x00000100)        /* bit 8 */
#define  NVIC_ICPR_CLRPEND_9                 ((u32)0x00000200)        /* bit 9 */
#define  NVIC_ICPR_CLRPEND_10                ((u32)0x00000400)        /* bit 10 */
#define  NVIC_ICPR_CLRPEND_11                ((u32)0x00000800)        /* bit 11 */
#define  NVIC_ICPR_CLRPEND_12                ((u32)0x00001000)        /* bit 12 */
#define  NVIC_ICPR_CLRPEND_13                ((u32)0x00002000)        /* bit 13 */
#define  NVIC_ICPR_CLRPEND_14                ((u32)0x00004000)        /* bit 14 */
#define  NVIC_ICPR_CLRPEND_15                ((u32)0x00008000)        /* bit 15 */
#define  NVIC_ICPR_CLRPEND_16                ((u32)0x00010000)        /* bit 16 */
#define  NVIC_ICPR_CLRPEND_17                ((u32)0x00020000)        /* bit 17 */
#define  NVIC_ICPR_CLRPEND_18                ((u32)0x00040000)        /* bit 18 */
#define  NVIC_ICPR_CLRPEND_19                ((u32)0x00080000)        /* bit 19 */
#define  NVIC_ICPR_CLRPEND_20                ((u32)0x00100000)        /* bit 20 */
#define  NVIC_ICPR_CLRPEND_21                ((u32)0x00200000)        /* bit 21 */
#define  NVIC_ICPR_CLRPEND_22                ((u32)0x00400000)        /* bit 22 */
#define  NVIC_ICPR_CLRPEND_23                ((u32)0x00800000)        /* bit 23 */
#define  NVIC_ICPR_CLRPEND_24                ((u32)0x01000000)        /* bit 24 */
#define  NVIC_ICPR_CLRPEND_25                ((u32)0x02000000)        /* bit 25 */
#define  NVIC_ICPR_CLRPEND_26                ((u32)0x04000000)        /* bit 26 */
#define  NVIC_ICPR_CLRPEND_27                ((u32)0x08000000)        /* bit 27 */
#define  NVIC_ICPR_CLRPEND_28                ((u32)0x10000000)        /* bit 28 */
#define  NVIC_ICPR_CLRPEND_29                ((u32)0x20000000)        /* bit 29 */
#define  NVIC_ICPR_CLRPEND_30                ((u32)0x40000000)        /* bit 30 */
#define  NVIC_ICPR_CLRPEND_31                ((u32)0x80000000)        /* bit 31 */


/******************  Bit definition for NVIC_IABR register  *******************/
#define  NVIC_IABR_ACTIVE                    ((u32)0xFFFFFFFF)        /* Interrupt active flags */
#define  NVIC_IABR_ACTIVE_0                  ((u32)0x00000001)        /* bit 0 */
#define  NVIC_IABR_ACTIVE_1                  ((u32)0x00000002)        /* bit 1 */
#define  NVIC_IABR_ACTIVE_2                  ((u32)0x00000004)        /* bit 2 */
#define  NVIC_IABR_ACTIVE_3                  ((u32)0x00000008)        /* bit 3 */
#define  NVIC_IABR_ACTIVE_4                  ((u32)0x00000010)        /* bit 4 */
#define  NVIC_IABR_ACTIVE_5                  ((u32)0x00000020)        /* bit 5 */
#define  NVIC_IABR_ACTIVE_6                  ((u32)0x00000040)        /* bit 6 */
#define  NVIC_IABR_ACTIVE_7                  ((u32)0x00000080)        /* bit 7 */
#define  NVIC_IABR_ACTIVE_8                  ((u32)0x00000100)        /* bit 8 */
#define  NVIC_IABR_ACTIVE_9                  ((u32)0x00000200)        /* bit 9 */
#define  NVIC_IABR_ACTIVE_10                 ((u32)0x00000400)        /* bit 10 */
#define  NVIC_IABR_ACTIVE_11                 ((u32)0x00000800)        /* bit 11 */
#define  NVIC_IABR_ACTIVE_12                 ((u32)0x00001000)        /* bit 12 */
#define  NVIC_IABR_ACTIVE_13                 ((u32)0x00002000)        /* bit 13 */
#define  NVIC_IABR_ACTIVE_14                 ((u32)0x00004000)        /* bit 14 */
#define  NVIC_IABR_ACTIVE_15                 ((u32)0x00008000)        /* bit 15 */
#define  NVIC_IABR_ACTIVE_16                 ((u32)0x00010000)        /* bit 16 */
#define  NVIC_IABR_ACTIVE_17                 ((u32)0x00020000)        /* bit 17 */
#define  NVIC_IABR_ACTIVE_18                 ((u32)0x00040000)        /* bit 18 */
#define  NVIC_IABR_ACTIVE_19                 ((u32)0x00080000)        /* bit 19 */
#define  NVIC_IABR_ACTIVE_20                 ((u32)0x00100000)        /* bit 20 */
#define  NVIC_IABR_ACTIVE_21                 ((u32)0x00200000)        /* bit 21 */
#define  NVIC_IABR_ACTIVE_22                 ((u32)0x00400000)        /* bit 22 */
#define  NVIC_IABR_ACTIVE_23                 ((u32)0x00800000)        /* bit 23 */
#define  NVIC_IABR_ACTIVE_24                 ((u32)0x01000000)        /* bit 24 */
#define  NVIC_IABR_ACTIVE_25                 ((u32)0x02000000)        /* bit 25 */
#define  NVIC_IABR_ACTIVE_26                 ((u32)0x04000000)        /* bit 26 */
#define  NVIC_IABR_ACTIVE_27                 ((u32)0x08000000)        /* bit 27 */
#define  NVIC_IABR_ACTIVE_28                 ((u32)0x10000000)        /* bit 28 */
#define  NVIC_IABR_ACTIVE_29                 ((u32)0x20000000)        /* bit 29 */
#define  NVIC_IABR_ACTIVE_30                 ((u32)0x40000000)        /* bit 30 */
#define  NVIC_IABR_ACTIVE_31                 ((u32)0x80000000)        /* bit 31 */


/******************  Bit definition for NVIC_PRI0 register  *******************/
#define  NVIC_IPR0_PRI_0                     ((u32)0x000000FF)        /* Priority of interrupt 0 */
#define  NVIC_IPR0_PRI_1                     ((u32)0x0000FF00)        /* Priority of interrupt 1 */
#define  NVIC_IPR0_PRI_2                     ((u32)0x00FF0000)        /* Priority of interrupt 2 */
#define  NVIC_IPR0_PRI_3                     ((u32)0xFF000000)        /* Priority of interrupt 3 */


/******************  Bit definition for NVIC_PRI1 register  *******************/
#define  NVIC_IPR1_PRI_4                     ((u32)0x000000FF)        /* Priority of interrupt 4 */
#define  NVIC_IPR1_PRI_5                     ((u32)0x0000FF00)        /* Priority of interrupt 5 */
#define  NVIC_IPR1_PRI_6                     ((u32)0x00FF0000)        /* Priority of interrupt 6 */
#define  NVIC_IPR1_PRI_7                     ((u32)0xFF000000)        /* Priority of interrupt 7 */


