steup/contiki/cpu/arm/atsam3s4/ATSAM3S4_map.h
#define  ADC_CR1_DUALMOD                     ((u32)0x000F0000)        /* DUALMOD[3:0] bits (Dual mode selection) */
#define  ADC_CR1_DUALMOD_0                   ((u32)0x00010000)        /* Bit 0 */
#define  ADC_CR1_DUALMOD_1                   ((u32)0x00020000)        /* Bit 1 */
#define  ADC_CR1_DUALMOD_2                   ((u32)0x00040000)        /* Bit 2 */
#define  ADC_CR1_DUALMOD_3                   ((u32)0x00080000)        /* Bit 3 */

#define  ADC_CR1_JAWDEN                      ((u32)0x00400000)        /* Analog watchdog enable on injected channels */
#define  ADC_CR1_AWDEN                       ((u32)0x00800000)        /* Analog watchdog enable on regular channels */

  
/*******************  Bit definition for ADC_CR2 register  ********************/
#define  ADC_CR2_ADON                        ((u32)0x00000001)        /* A/D Converter ON / OFF */
#define  ADC_CR2_CONT                        ((u32)0x00000002)        /* Continuous Conversion */
#define  ADC_CR2_CAL                         ((u32)0x00000004)        /* A/D Calibration */
#define  ADC_CR2_RSTCAL                      ((u32)0x00000008)        /* Reset Calibration */
#define  ADC_CR2_DMA                         ((u32)0x00000100)        /* Direct Memory access mode */
#define  ADC_CR2_ALIGN                       ((u32)0x00000800)        /* Data Alignment */

#define  ADC_CR2_JEXTSEL                     ((u32)0x00007000)        /* JEXTSEL[2:0] bits (External event select for injected group) */
#define  ADC_CR2_JEXTSEL_0                   ((u32)0x00001000)        /* Bit 0 */
#define  ADC_CR2_JEXTSEL_1                   ((u32)0x00002000)        /* Bit 1 */
#define  ADC_CR2_JEXTSEL_2                   ((u32)0x00004000)        /* Bit 2 */

#define  ADC_CR2_JEXTTRIG                    ((u32)0x00008000)        /* External Trigger Conversion mode for injected channels */

#define  ADC_CR2_EXTSEL                      ((u32)0x000E0000)        /* EXTSEL[2:0] bits (External Event Select for regular group) */
#define  ADC_CR2_EXTSEL_0                    ((u32)0x00020000)        /* Bit 0 */
#define  ADC_CR2_EXTSEL_1                    ((u32)0x00040000)        /* Bit 1 */
#define  ADC_CR2_EXTSEL_2                    ((u32)0x00080000)        /* Bit 2 */

#define  ADC_CR2_EXTTRIG                     ((u32)0x00100000)        /* External Trigger Conversion mode for regular channels */
#define  ADC_CR2_JSWSTART                    ((u32)0x00200000)        /* Start Conversion of injected channels */
#define  ADC_CR2_SWSTART                     ((u32)0x00400000)        /* Start Conversion of regular channels */
#define  ADC_CR2_TSVREFE                     ((u32)0x00800000)        /* Temperature Sensor and VREFINT Enable */


/******************  Bit definition for ADC_SMPR1 register  *******************/
#define  ADC_SMPR1_SMP10                     ((u32)0x00000007)        /* SMP10[2:0] bits (Channel 10 Sample time selection) */
#define  ADC_SMPR1_SMP10_0                   ((u32)0x00000001)        /* Bit 0 */
#define  ADC_SMPR1_SMP10_1                   ((u32)0x00000002)        /* Bit 1 */
#define  ADC_SMPR1_SMP10_2                   ((u32)0x00000004)        /* Bit 2 */

#define  ADC_SMPR1_SMP11                     ((u32)0x00000038)        /* SMP11[2:0] bits (Channel 11 Sample time selection) */
#define  ADC_SMPR1_SMP11_0                   ((u32)0x00000008)        /* Bit 0 */
#define  ADC_SMPR1_SMP11_1                   ((u32)0x00000010)        /* Bit 1 */
#define  ADC_SMPR1_SMP11_2                   ((u32)0x00000020)        /* Bit 2 */

#define  ADC_SMPR1_SMP12                     ((u32)0x000001C0)        /* SMP12[2:0] bits (Channel 12 Sample time selection) */
#define  ADC_SMPR1_SMP12_0                   ((u32)0x00000040)        /* Bit 0 */
#define  ADC_SMPR1_SMP12_1                   ((u32)0x00000080)        /* Bit 1 */
#define  ADC_SMPR1_SMP12_2                   ((u32)0x00000100)        /* Bit 2 */

#define  ADC_SMPR1_SMP13                     ((u32)0x00000E00)        /* SMP13[2:0] bits (Channel 13 Sample time selection) */
#define  ADC_SMPR1_SMP13_0                   ((u32)0x00000200)        /* Bit 0 */
#define  ADC_SMPR1_SMP13_1                   ((u32)0x00000400)        /* Bit 1 */
#define  ADC_SMPR1_SMP13_2                   ((u32)0x00000800)        /* Bit 2 */

#define  ADC_SMPR1_SMP14                     ((u32)0x00007000)        /* SMP14[2:0] bits (Channel 14 Sample time selection) */
#define  ADC_SMPR1_SMP14_0                   ((u32)0x00001000)        /* Bit 0 */
#define  ADC_SMPR1_SMP14_1                   ((u32)0x00002000)        /* Bit 1 */
#define  ADC_SMPR1_SMP14_2                   ((u32)0x00004000)        /* Bit 2 */

#define  ADC_SMPR1_SMP15                     ((u32)0x00038000)        /* SMP15[2:0] bits (Channel 15 Sample time selection) */
#define  ADC_SMPR1_SMP15_0                   ((u32)0x00008000)        /* Bit 0 */
#define  ADC_SMPR1_SMP15_1                   ((u32)0x00010000)        /* Bit 1 */
#define  ADC_SMPR1_SMP15_2                   ((u32)0x00020000)        /* Bit 2 */

#define  ADC_SMPR1_SMP16                     ((u32)0x001C0000)        /* SMP16[2:0] bits (Channel 16 Sample time selection) */
#define  ADC_SMPR1_SMP16_0                   ((u32)0x00040000)        /* Bit 0 */
#define  ADC_SMPR1_SMP16_1                   ((u32)0x00080000)        /* Bit 1 */
#define  ADC_SMPR1_SMP16_2                   ((u32)0x00100000)        /* Bit 2 */

#define  ADC_SMPR1_SMP17                     ((u32)0x00E00000)        /* SMP17[2:0] bits (Channel 17 Sample time selection) */
#define  ADC_SMPR1_SMP17_0                   ((u32)0x00200000)        /* Bit 0 */
#define  ADC_SMPR1_SMP17_1                   ((u32)0x00400000)        /* Bit 1 */
#define  ADC_SMPR1_SMP17_2                   ((u32)0x00800000)        /* Bit 2 */


/******************  Bit definition for ADC_SMPR2 register  *******************/
#define  ADC_SMPR2_SMP0                      ((u32)0x00000007)        /* SMP0[2:0] bits (Channel 0 Sample time selection) */
#define  ADC_SMPR2_SMP0_0                    ((u32)0x00000001)        /* Bit 0 */
#define  ADC_SMPR2_SMP0_1                    ((u32)0x00000002)        /* Bit 1 */
#define  ADC_SMPR2_SMP0_2                    ((u32)0x00000004)        /* Bit 2 */

#define  ADC_SMPR2_SMP1                      ((u32)0x00000038)        /* SMP1[2:0] bits (Channel 1 Sample time selection) */
#define  ADC_SMPR2_SMP1_0                    ((u32)0x00000008)        /* Bit 0 */
#define  ADC_SMPR2_SMP1_1                    ((u32)0x00000010)        /* Bit 1 */
#define  ADC_SMPR2_SMP1_2                    ((u32)0x00000020)        /* Bit 2 */

#define  ADC_SMPR2_SMP2                      ((u32)0x000001C0)        /* SMP2[2:0] bits (Channel 2 Sample time selection) */
#define  ADC_SMPR2_SMP2_0                    ((u32)0x00000040)        /* Bit 0 */
#define  ADC_SMPR2_SMP2_1                    ((u32)0x00000080)        /* Bit 1 */
#define  ADC_SMPR2_SMP2_2                    ((u32)0x00000100)        /* Bit 2 */

#define  ADC_SMPR2_SMP3                      ((u32)0x00000E00)        /* SMP3[2:0] bits (Channel 3 Sample time selection) */
#define  ADC_SMPR2_SMP3_0                    ((u32)0x00000200)        /* Bit 0 */
#define  ADC_SMPR2_SMP3_1                    ((u32)0x00000400)        /* Bit 1 */
#define  ADC_SMPR2_SMP3_2                    ((u32)0x00000800)        /* Bit 2 */

#define  ADC_SMPR2_SMP4                      ((u32)0x00007000)        /* SMP4[2:0] bits (Channel 4 Sample time selection) */
#define  ADC_SMPR2_SMP4_0                    ((u32)0x00001000)        /* Bit 0 */
#define  ADC_SMPR2_SMP4_1                    ((u32)0x00002000)        /* Bit 1 */
#define  ADC_SMPR2_SMP4_2                    ((u32)0x00004000)        /* Bit 2 */

