steup/contiki/cpu/arm/atsam3s4/ATSAM3S4_map.h
#define  ADC_SMPR2_SMP5                      ((u32)0x00038000)        /* SMP5[2:0] bits (Channel 5 Sample time selection) */
#define  ADC_SMPR2_SMP5_0                    ((u32)0x00008000)        /* Bit 0 */
#define  ADC_SMPR2_SMP5_1                    ((u32)0x00010000)        /* Bit 1 */
#define  ADC_SMPR2_SMP5_2                    ((u32)0x00020000)        /* Bit 2 */

#define  ADC_SMPR2_SMP6                      ((u32)0x001C0000)        /* SMP6[2:0] bits (Channel 6 Sample time selection) */
#define  ADC_SMPR2_SMP6_0                    ((u32)0x00040000)        /* Bit 0 */
#define  ADC_SMPR2_SMP6_1                    ((u32)0x00080000)        /* Bit 1 */
#define  ADC_SMPR2_SMP6_2                    ((u32)0x00100000)        /* Bit 2 */

#define  ADC_SMPR2_SMP7                      ((u32)0x00E00000)        /* SMP7[2:0] bits (Channel 7 Sample time selection) */
#define  ADC_SMPR2_SMP7_0                    ((u32)0x00200000)        /* Bit 0 */
#define  ADC_SMPR2_SMP7_1                    ((u32)0x00400000)        /* Bit 1 */
#define  ADC_SMPR2_SMP7_2                    ((u32)0x00800000)        /* Bit 2 */

#define  ADC_SMPR2_SMP8                      ((u32)0x07000000)        /* SMP8[2:0] bits (Channel 8 Sample time selection) */
#define  ADC_SMPR2_SMP8_0                    ((u32)0x01000000)        /* Bit 0 */
#define  ADC_SMPR2_SMP8_1                    ((u32)0x02000000)        /* Bit 1 */
#define  ADC_SMPR2_SMP8_2                    ((u32)0x04000000)        /* Bit 2 */

#define  ADC_SMPR2_SMP9                      ((u32)0x38000000)        /* SMP9[2:0] bits (Channel 9 Sample time selection) */
#define  ADC_SMPR2_SMP9_0                    ((u32)0x08000000)        /* Bit 0 */
#define  ADC_SMPR2_SMP9_1                    ((u32)0x10000000)        /* Bit 1 */
#define  ADC_SMPR2_SMP9_2                    ((u32)0x20000000)        /* Bit 2 */


/******************  Bit definition for ADC_JOFR1 register  *******************/
#define  ADC_JOFR1_JOFFSET1                  ((u16)0x0FFF)            /* Data offset for injected channel 1 */


/******************  Bit definition for ADC_JOFR2 register  *******************/
#define  ADC_JOFR2_JOFFSET2                  ((u16)0x0FFF)            /* Data offset for injected channel 2 */


/******************  Bit definition for ADC_JOFR3 register  *******************/
#define  ADC_JOFR3_JOFFSET3                  ((u16)0x0FFF)            /* Data offset for injected channel 3 */


/******************  Bit definition for ADC_JOFR4 register  *******************/
#define  ADC_JOFR4_JOFFSET4                  ((u16)0x0FFF)            /* Data offset for injected channel 4 */


/*******************  Bit definition for ADC_HTR register  ********************/
#define  ADC_HTR_HT                          ((u16)0x0FFF)            /* Analog watchdog high threshold */


/*******************  Bit definition for ADC_LTR register  ********************/
#define  ADC_LTR_LT                          ((u16)0x0FFF)            /* Analog watchdog low threshold */


/*******************  Bit definition for ADC_SQR1 register  *******************/
#define  ADC_SQR1_SQ13                       ((u32)0x0000001F)        /* SQ13[4:0] bits (13th conversion in regular sequence) */
#define  ADC_SQR1_SQ13_0                     ((u32)0x00000001)        /* Bit 0 */
#define  ADC_SQR1_SQ13_1                     ((u32)0x00000002)        /* Bit 1 */
#define  ADC_SQR1_SQ13_2                     ((u32)0x00000004)        /* Bit 2 */
#define  ADC_SQR1_SQ13_3                     ((u32)0x00000008)        /* Bit 3 */
#define  ADC_SQR1_SQ13_4                     ((u32)0x00000010)        /* Bit 4 */

#define  ADC_SQR1_SQ14                       ((u32)0x000003E0)        /* SQ14[4:0] bits (14th conversion in regular sequence) */
#define  ADC_SQR1_SQ14_0                     ((u32)0x00000020)        /* Bit 0 */
#define  ADC_SQR1_SQ14_1                     ((u32)0x00000040)        /* Bit 1 */
#define  ADC_SQR1_SQ14_2                     ((u32)0x00000080)        /* Bit 2 */
#define  ADC_SQR1_SQ14_3                     ((u32)0x00000100)        /* Bit 3 */
#define  ADC_SQR1_SQ14_4                     ((u32)0x00000200)        /* Bit 4 */

#define  ADC_SQR1_SQ15                       ((u32)0x00007C00)        /* SQ15[4:0] bits (15th conversion in regular sequence) */
#define  ADC_SQR1_SQ15_0                     ((u32)0x00000400)        /* Bit 0 */
#define  ADC_SQR1_SQ15_1                     ((u32)0x00000800)        /* Bit 1 */
#define  ADC_SQR1_SQ15_2                     ((u32)0x00001000)        /* Bit 2 */
#define  ADC_SQR1_SQ15_3                     ((u32)0x00002000)        /* Bit 3 */
#define  ADC_SQR1_SQ15_4                     ((u32)0x00004000)        /* Bit 4 */

#define  ADC_SQR1_SQ16                       ((u32)0x000F8000)        /* SQ16[4:0] bits (16th conversion in regular sequence) */
#define  ADC_SQR1_SQ16_0                     ((u32)0x00008000)        /* Bit 0 */
#define  ADC_SQR1_SQ16_1                     ((u32)0x00010000)        /* Bit 1 */
#define  ADC_SQR1_SQ16_2                     ((u32)0x00020000)        /* Bit 2 */
#define  ADC_SQR1_SQ16_3                     ((u32)0x00040000)        /* Bit 3 */
#define  ADC_SQR1_SQ16_4                     ((u32)0x00080000)        /* Bit 4 */

#define  ADC_SQR1_L                          ((u32)0x00F00000)        /* L[3:0] bits (Regular channel sequence length) */
#define  ADC_SQR1_L_0                        ((u32)0x00100000)        /* Bit 0 */
#define  ADC_SQR1_L_1                        ((u32)0x00200000)        /* Bit 1 */
#define  ADC_SQR1_L_2                        ((u32)0x00400000)        /* Bit 2 */
#define  ADC_SQR1_L_3                        ((u32)0x00800000)        /* Bit 3 */


/*******************  Bit definition for ADC_SQR2 register  *******************/
#define  ADC_SQR2_SQ7                        ((u32)0x0000001F)        /* SQ7[4:0] bits (7th conversion in regular sequence) */
#define  ADC_SQR2_SQ7_0                      ((u32)0x00000001)        /* Bit 0 */
#define  ADC_SQR2_SQ7_1                      ((u32)0x00000002)        /* Bit 1 */
#define  ADC_SQR2_SQ7_2                      ((u32)0x00000004)        /* Bit 2 */
#define  ADC_SQR2_SQ7_3                      ((u32)0x00000008)        /* Bit 3 */
#define  ADC_SQR2_SQ7_4                      ((u32)0x00000010)        /* Bit 4 */

#define  ADC_SQR2_SQ8                        ((u32)0x000003E0)        /* SQ8[4:0] bits (8th conversion in regular sequence) */
#define  ADC_SQR2_SQ8_0                      ((u32)0x00000020)        /* Bit 0 */
#define  ADC_SQR2_SQ8_1                      ((u32)0x00000040)        /* Bit 1 */
#define  ADC_SQR2_SQ8_2                      ((u32)0x00000080)        /* Bit 2 */
#define  ADC_SQR2_SQ8_3                      ((u32)0x00000100)        /* Bit 3 */
#define  ADC_SQR2_SQ8_4                      ((u32)0x00000200)        /* Bit 4 */

#define  ADC_SQR2_SQ9                        ((u32)0x00007C00)        /* SQ9[4:0] bits (9th conversion in regular sequence) */
#define  ADC_SQR2_SQ9_0                      ((u32)0x00000400)        /* Bit 0 */
#define  ADC_SQR2_SQ9_1                      ((u32)0x00000800)        /* Bit 1 */
#define  ADC_SQR2_SQ9_2                      ((u32)0x00001000)        /* Bit 2 */
#define  ADC_SQR2_SQ9_3                      ((u32)0x00002000)        /* Bit 3 */
#define  ADC_SQR2_SQ9_4                      ((u32)0x00004000)        /* Bit 4 */

#define  ADC_SQR2_SQ10                       ((u32)0x000F8000)        /* SQ10[4:0] bits (10th conversion in regular sequence) */
#define  ADC_SQR2_SQ10_0                     ((u32)0x00008000)        /* Bit 0 */
#define  ADC_SQR2_SQ10_1                     ((u32)0x00010000)        /* Bit 1 */
#define  ADC_SQR2_SQ10_2                     ((u32)0x00020000)        /* Bit 2 */
#define  ADC_SQR2_SQ10_3                     ((u32)0x00040000)        /* Bit 3 */
#define  ADC_SQR2_SQ10_4                     ((u32)0x00080000)        /* Bit 4 */

#define  ADC_SQR2_SQ11                       ((u32)0x01F00000)        /* SQ11[4:0] bits (11th conversion in regular sequence) */
#define  ADC_SQR2_SQ11_0                     ((u32)0x00100000)        /* Bit 0 */
#define  ADC_SQR2_SQ11_1                     ((u32)0x00200000)        /* Bit 1 */
#define  ADC_SQR2_SQ11_2                     ((u32)0x00400000)        /* Bit 2 */
#define  ADC_SQR2_SQ11_3                     ((u32)0x00800000)        /* Bit 3 */
#define  ADC_SQR2_SQ11_4                     ((u32)0x01000000)        /* Bit 4 */

#define  ADC_SQR2_SQ12                       ((u32)0x3E000000)        /* SQ12[4:0] bits (12th conversion in regular sequence) */
#define  ADC_SQR2_SQ12_0                     ((u32)0x02000000)        /* Bit 0 */
#define  ADC_SQR2_SQ12_1                     ((u32)0x04000000)        /* Bit 1 */
#define  ADC_SQR2_SQ12_2                     ((u32)0x08000000)        /* Bit 2 */
#define  ADC_SQR2_SQ12_3                     ((u32)0x10000000)        /* Bit 3 */
#define  ADC_SQR2_SQ12_4                     ((u32)0x20000000)        /* Bit 4 */


