steup/contiki/cpu/arm/atsam3s4/ATSAM3S4_map.h
/*******************  Bit definition for ADC_SQR3 register  *******************/
#define  ADC_SQR3_SQ1                        ((u32)0x0000001F)        /* SQ1[4:0] bits (1st conversion in regular sequence) */
#define  ADC_SQR3_SQ1_0                      ((u32)0x00000001)        /* Bit 0 */
#define  ADC_SQR3_SQ1_1                      ((u32)0x00000002)        /* Bit 1 */
#define  ADC_SQR3_SQ1_2                      ((u32)0x00000004)        /* Bit 2 */
#define  ADC_SQR3_SQ1_3                      ((u32)0x00000008)        /* Bit 3 */
#define  ADC_SQR3_SQ1_4                      ((u32)0x00000010)        /* Bit 4 */

#define  ADC_SQR3_SQ2                        ((u32)0x000003E0)        /* SQ2[4:0] bits (2nd conversion in regular sequence) */
#define  ADC_SQR3_SQ2_0                      ((u32)0x00000020)        /* Bit 0 */
#define  ADC_SQR3_SQ2_1                      ((u32)0x00000040)        /* Bit 1 */
#define  ADC_SQR3_SQ2_2                      ((u32)0x00000080)        /* Bit 2 */
#define  ADC_SQR3_SQ2_3                      ((u32)0x00000100)        /* Bit 3 */
#define  ADC_SQR3_SQ2_4                      ((u32)0x00000200)        /* Bit 4 */

#define  ADC_SQR3_SQ3                        ((u32)0x00007C00)        /* SQ3[4:0] bits (3rd conversion in regular sequence) */
#define  ADC_SQR3_SQ3_0                      ((u32)0x00000400)        /* Bit 0 */
#define  ADC_SQR3_SQ3_1                      ((u32)0x00000800)        /* Bit 1 */
#define  ADC_SQR3_SQ3_2                      ((u32)0x00001000)        /* Bit 2 */
#define  ADC_SQR3_SQ3_3                      ((u32)0x00002000)        /* Bit 3 */
#define  ADC_SQR3_SQ3_4                      ((u32)0x00004000)        /* Bit 4 */

#define  ADC_SQR3_SQ4                        ((u32)0x000F8000)        /* SQ4[4:0] bits (4th conversion in regular sequence) */
#define  ADC_SQR3_SQ4_0                      ((u32)0x00008000)        /* Bit 0 */
#define  ADC_SQR3_SQ4_1                      ((u32)0x00010000)        /* Bit 1 */
#define  ADC_SQR3_SQ4_2                      ((u32)0x00020000)        /* Bit 2 */
#define  ADC_SQR3_SQ4_3                      ((u32)0x00040000)        /* Bit 3 */
#define  ADC_SQR3_SQ4_4                      ((u32)0x00080000)        /* Bit 4 */

#define  ADC_SQR3_SQ5                        ((u32)0x01F00000)        /* SQ5[4:0] bits (5th conversion in regular sequence) */
#define  ADC_SQR3_SQ5_0                      ((u32)0x00100000)        /* Bit 0 */
#define  ADC_SQR3_SQ5_1                      ((u32)0x00200000)        /* Bit 1 */
#define  ADC_SQR3_SQ5_2                      ((u32)0x00400000)        /* Bit 2 */
#define  ADC_SQR3_SQ5_3                      ((u32)0x00800000)        /* Bit 3 */
#define  ADC_SQR3_SQ5_4                      ((u32)0x01000000)        /* Bit 4 */

#define  ADC_SQR3_SQ6                        ((u32)0x3E000000)        /* SQ6[4:0] bits (6th conversion in regular sequence) */
#define  ADC_SQR3_SQ6_0                      ((u32)0x02000000)        /* Bit 0 */
#define  ADC_SQR3_SQ6_1                      ((u32)0x04000000)        /* Bit 1 */
#define  ADC_SQR3_SQ6_2                      ((u32)0x08000000)        /* Bit 2 */
#define  ADC_SQR3_SQ6_3                      ((u32)0x10000000)        /* Bit 3 */
#define  ADC_SQR3_SQ6_4                      ((u32)0x20000000)        /* Bit 4 */


/*******************  Bit definition for ADC_JSQR register  *******************/
#define  ADC_JSQR_JSQ1                       ((u32)0x0000001F)        /* JSQ1[4:0] bits (1st conversion in injected sequence) */  
#define  ADC_JSQR_JSQ1_0                     ((u32)0x00000001)        /* Bit 0 */
#define  ADC_JSQR_JSQ1_1                     ((u32)0x00000002)        /* Bit 1 */
#define  ADC_JSQR_JSQ1_2                     ((u32)0x00000004)        /* Bit 2 */
#define  ADC_JSQR_JSQ1_3                     ((u32)0x00000008)        /* Bit 3 */
#define  ADC_JSQR_JSQ1_4                     ((u32)0x00000010)        /* Bit 4 */

#define  ADC_JSQR_JSQ2                       ((u32)0x000003E0)        /* JSQ2[4:0] bits (2nd conversion in injected sequence) */
#define  ADC_JSQR_JSQ2_0                     ((u32)0x00000020)        /* Bit 0 */
#define  ADC_JSQR_JSQ2_1                     ((u32)0x00000040)        /* Bit 1 */
#define  ADC_JSQR_JSQ2_2                     ((u32)0x00000080)        /* Bit 2 */
#define  ADC_JSQR_JSQ2_3                     ((u32)0x00000100)        /* Bit 3 */
#define  ADC_JSQR_JSQ2_4                     ((u32)0x00000200)        /* Bit 4 */

#define  ADC_JSQR_JSQ3                       ((u32)0x00007C00)        /* JSQ3[4:0] bits (3rd conversion in injected sequence) */
#define  ADC_JSQR_JSQ3_0                     ((u32)0x00000400)        /* Bit 0 */
#define  ADC_JSQR_JSQ3_1                     ((u32)0x00000800)        /* Bit 1 */
#define  ADC_JSQR_JSQ3_2                     ((u32)0x00001000)        /* Bit 2 */
#define  ADC_JSQR_JSQ3_3                     ((u32)0x00002000)        /* Bit 3 */
#define  ADC_JSQR_JSQ3_4                     ((u32)0x00004000)        /* Bit 4 */

#define  ADC_JSQR_JSQ4                       ((u32)0x000F8000)        /* JSQ4[4:0] bits (4th conversion in injected sequence) */
#define  ADC_JSQR_JSQ4_0                     ((u32)0x00008000)        /* Bit 0 */
#define  ADC_JSQR_JSQ4_1                     ((u32)0x00010000)        /* Bit 1 */
#define  ADC_JSQR_JSQ4_2                     ((u32)0x00020000)        /* Bit 2 */
#define  ADC_JSQR_JSQ4_3                     ((u32)0x00040000)        /* Bit 3 */
#define  ADC_JSQR_JSQ4_4                     ((u32)0x00080000)        /* Bit 4 */

#define  ADC_JSQR_JL                         ((u32)0x00300000)        /* JL[1:0] bits (Injected Sequence length) */
#define  ADC_JSQR_JL_0                       ((u32)0x00100000)        /* Bit 0 */
#define  ADC_JSQR_JL_1                       ((u32)0x00200000)        /* Bit 1 */


/*******************  Bit definition for ADC_JDR1 register  *******************/
#define  ADC_JDR1_JDATA                      ((u16)0xFFFF)            /* Injected data */


/*******************  Bit definition for ADC_JDR2 register  *******************/
#define  ADC_JDR2_JDATA                      ((u16)0xFFFF)            /* Injected data */


/*******************  Bit definition for ADC_JDR3 register  *******************/
#define  ADC_JDR3_JDATA                      ((u16)0xFFFF)            /* Injected data */


/*******************  Bit definition for ADC_JDR4 register  *******************/
#define  ADC_JDR4_JDATA                      ((u16)0xFFFF)            /* Injected data */


