steup/contiki/cpu/arm/atsam3s4/ATSAM3S4_map.h
/********************  Bit definition for ADC_DR register  ********************/
#define  ADC_DR_DATA                         ((u32)0x0000FFFF)        /* Regular data */
#define  ADC_DR_ADC2DATA                     ((u32)0xFFFF0000)        /* ADC2 data */



/******************************************************************************/
/*                                                                            */
/*                      Digital to Analog Converter                           */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for DAC_CR register  ********************/
#define  DAC_CR_EN1                          ((u32)0x00000001)        /* DAC channel1 enable */
#define  DAC_CR_BOFF1                        ((u32)0x00000002)        /* DAC channel1 output buffer disable */
#define  DAC_CR_TEN1                         ((u32)0x00000004)        /* DAC channel1 Trigger enable */

#define  DAC_CR_TSEL1                        ((u32)0x00000038)        /* TSEL1[2:0] (DAC channel1 Trigger selection) */
#define  DAC_CR_TSEL1_0                      ((u32)0x00000008)        /* Bit 0 */
#define  DAC_CR_TSEL1_1                      ((u32)0x00000010)        /* Bit 1 */
#define  DAC_CR_TSEL1_2                      ((u32)0x00000020)        /* Bit 2 */

#define  DAC_CR_WAVE1                        ((u32)0x000000C0)        /* WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define  DAC_CR_WAVE1_0                      ((u32)0x00000040)        /* Bit 0 */
#define  DAC_CR_WAVE1_1                      ((u32)0x00000080)        /* Bit 1 */

#define  DAC_CR_MAMP1                        ((u32)0x00000F00)        /* MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) */
#define  DAC_CR_MAMP1_0                      ((u32)0x00000100)        /* Bit 0 */
#define  DAC_CR_MAMP1_1                      ((u32)0x00000200)        /* Bit 1 */
#define  DAC_CR_MAMP1_2                      ((u32)0x00000400)        /* Bit 2 */
#define  DAC_CR_MAMP1_3                      ((u32)0x00000800)        /* Bit 3 */

#define  DAC_CR_DMAEN1                       ((u32)0x00001000)        /* DAC channel1 DMA enable */
#define  DAC_CR_EN2                          ((u32)0x00010000)        /* DAC channel2 enable */
#define  DAC_CR_BOFF2                        ((u32)0x00020000)        /* DAC channel2 output buffer disable */
#define  DAC_CR_TEN2                         ((u32)0x00040000)        /* DAC channel2 Trigger enable */

#define  DAC_CR_TSEL2                        ((u32)0x00380000)        /* TSEL2[2:0] (DAC channel2 Trigger selection) */
#define  DAC_CR_TSEL2_0                      ((u32)0x00080000)        /* Bit 0 */
#define  DAC_CR_TSEL2_1                      ((u32)0x00100000)        /* Bit 1 */
#define  DAC_CR_TSEL2_2                      ((u32)0x00200000)        /* Bit 2 */

#define  DAC_CR_WAVE2                        ((u32)0x00C00000)        /* WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable) */
#define  DAC_CR_WAVE2_0                      ((u32)0x00400000)        /* Bit 0 */
#define  DAC_CR_WAVE2_1                      ((u32)0x00800000)        /* Bit 1 */

#define  DAC_CR_MAMP2                        ((u32)0x0F000000)        /* MAMP2[3:0] (DAC channel2 Mask/Amplitude selector) */
#define  DAC_CR_MAMP2_0                      ((u32)0x01000000)        /* Bit 0 */
#define  DAC_CR_MAMP2_1                      ((u32)0x02000000)        /* Bit 1 */
#define  DAC_CR_MAMP2_2                      ((u32)0x04000000)        /* Bit 2 */
#define  DAC_CR_MAMP2_3                      ((u32)0x08000000)        /* Bit 3 */

#define  DAC_CR_DMAEN2                       ((u32)0x10000000)        /* DAC channel2 DMA enabled */


/*****************  Bit definition for DAC_SWTRIGR register  ******************/
#define  DAC_SWTRIGR_SWTRIG1                 ((u8)0x01)               /* DAC channel1 software trigger */
#define  DAC_SWTRIGR_SWTRIG2                 ((u8)0x02)               /* DAC channel2 software trigger */


/*****************  Bit definition for DAC_DHR12R1 register  ******************/
#define  DAC_DHR12R1_DACC1DHR                ((u16)0x0FFF)            /* DAC channel1 12-bit Right aligned data */


/*****************  Bit definition for DAC_DHR12L1 register  ******************/
#define  DAC_DHR12L1_DACC1DHR                ((u16)0xFFF0)            /* DAC channel1 12-bit Left aligned data */


/******************  Bit definition for DAC_DHR8R1 register  ******************/
#define  DAC_DHR8R1_DACC1DHR                 ((u8)0xFF)               /* DAC channel1 8-bit Right aligned data */


/*****************  Bit definition for DAC_DHR12R2 register  ******************/
#define  DAC_DHR12R2_DACC2DHR                ((u16)0x0FFF)            /* DAC channel2 12-bit Right aligned data */


/*****************  Bit definition for DAC_DHR12L2 register  ******************/
#define  DAC_DHR12L2_DACC2DHR                ((u16)0xFFF0)            /* DAC channel2 12-bit Left aligned data */


/******************  Bit definition for DAC_DHR8R2 register  ******************/
#define  DAC_DHR8R2_DACC2DHR                 ((u8)0xFF)               /* DAC channel2 8-bit Right aligned data */


/*****************  Bit definition for DAC_DHR12RD register  ******************/
#define  DAC_DHR12RD_DACC1DHR                ((u32)0x00000FFF)        /* DAC channel1 12-bit Right aligned data */
#define  DAC_DHR12RD_DACC2DHR                ((u32)0x0FFF0000)        /* DAC channel2 12-bit Right aligned data */


/*****************  Bit definition for DAC_DHR12LD register  ******************/
#define  DAC_DHR12LD_DACC1DHR                ((u32)0x0000FFF0)        /* DAC channel1 12-bit Left aligned data */
#define  DAC_DHR12LD_DACC2DHR                ((u32)0xFFF00000)        /* DAC channel2 12-bit Left aligned data */


/******************  Bit definition for DAC_DHR8RD register  ******************/
#define  DAC_DHR8RD_DACC1DHR                 ((u16)0x00FF)            /* DAC channel1 8-bit Right aligned data */
#define  DAC_DHR8RD_DACC2DHR                 ((u16)0xFF00)            /* DAC channel2 8-bit Right aligned data */


/*******************  Bit definition for DAC_DOR1 register  *******************/
#define  DAC_DOR1_DACC1DOR                   ((u16)0x0FFF)            /* DAC channel1 data output */


/*******************  Bit definition for DAC_DOR2 register  *******************/
#define  DAC_DOR2_DACC2DOR                   ((u16)0x0FFF)            /* DAC channel2 data output */



/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for TIM_CR1 register  ********************/
#define  TIM_CR1_CEN                         ((u16)0x0001)            /* Counter enable */
#define  TIM_CR1_UDIS                        ((u16)0x0002)            /* Update disable */
#define  TIM_CR1_URS                         ((u16)0x0004)            /* Update request source */
#define  TIM_CR1_OPM                         ((u16)0x0008)            /* One pulse mode */
#define  TIM_CR1_DIR                         ((u16)0x0010)            /* Direction */

#define  TIM_CR1_CMS                         ((u16)0x0060)            /* CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       ((u16)0x0020)            /* Bit 0 */
#define  TIM_CR1_CMS_1                       ((u16)0x0040)            /* Bit 1 */

#define  TIM_CR1_ARPE                        ((u16)0x0080)            /* Auto-reload preload enable */

#define  TIM_CR1_CKD                         ((u16)0x0300)            /* CKD[1:0] bits (clock division) */
#define  TIM_CR1_CKD_0                       ((u16)0x0100)            /* Bit 0 */
#define  TIM_CR1_CKD_1                       ((u16)0x0200)            /* Bit 1 */


