steup/contiki/cpu/arm/atsam3s4/ATSAM3S4_map.h
/*******************  Bit definition for TIM_CR2 register  ********************/
#define  TIM_CR2_CCPC                        ((u16)0x0001)            /* Capture/Compare Preloaded Control */
#define  TIM_CR2_CCUS                        ((u16)0x0004)            /* Capture/Compare Control Update Selection */
#define  TIM_CR2_CCDS                        ((u16)0x0008)            /* Capture/Compare DMA Selection */

#define  TIM_CR2_MMS                         ((u16)0x0070)            /* MMS[2:0] bits (Master Mode Selection) */
#define  TIM_CR2_MMS_0                       ((u16)0x0010)            /* Bit 0 */
#define  TIM_CR2_MMS_1                       ((u16)0x0020)            /* Bit 1 */
#define  TIM_CR2_MMS_2                       ((u16)0x0040)            /* Bit 2 */

#define  TIM_CR2_TI1S                        ((u16)0x0080)            /* TI1 Selection */
#define  TIM_CR2_OIS1                        ((u16)0x0100)            /* Output Idle state 1 (OC1 output) */
#define  TIM_CR2_OIS1N                       ((u16)0x0200)            /* Output Idle state 1 (OC1N output) */
#define  TIM_CR2_OIS2                        ((u16)0x0400)            /* Output Idle state 2 (OC2 output) */
#define  TIM_CR2_OIS2N                       ((u16)0x0800)            /* Output Idle state 2 (OC2N output) */
#define  TIM_CR2_OIS3                        ((u16)0x1000)            /* Output Idle state 3 (OC3 output) */
#define  TIM_CR2_OIS3N                       ((u16)0x2000)            /* Output Idle state 3 (OC3N output) */
#define  TIM_CR2_OIS4                        ((u16)0x4000)            /* Output Idle state 4 (OC4 output) */


/*******************  Bit definition for TIM_SMCR register  *******************/
#define  TIM_SMCR_SMS                        ((u16)0x0007)            /* SMS[2:0] bits (Slave mode selection) */
#define  TIM_SMCR_SMS_0                      ((u16)0x0001)            /* Bit 0 */
#define  TIM_SMCR_SMS_1                      ((u16)0x0002)            /* Bit 1 */
#define  TIM_SMCR_SMS_2                      ((u16)0x0004)            /* Bit 2 */

#define  TIM_SMCR_TS                         ((u16)0x0070)            /* TS[2:0] bits (Trigger selection) */
#define  TIM_SMCR_TS_0                       ((u16)0x0010)            /* Bit 0 */
#define  TIM_SMCR_TS_1                       ((u16)0x0020)            /* Bit 1 */
#define  TIM_SMCR_TS_2                       ((u16)0x0040)            /* Bit 2 */

#define  TIM_SMCR_MSM                        ((u16)0x0080)            /* Master/slave mode */

#define  TIM_SMCR_ETF                        ((u16)0x0F00)            /* ETF[3:0] bits (External trigger filter) */
#define  TIM_SMCR_ETF_0                      ((u16)0x0100)            /* Bit 0 */
#define  TIM_SMCR_ETF_1                      ((u16)0x0200)            /* Bit 1 */
#define  TIM_SMCR_ETF_2                      ((u16)0x0400)            /* Bit 2 */
#define  TIM_SMCR_ETF_3                      ((u16)0x0800)            /* Bit 3 */

#define  TIM_SMCR_ETPS                       ((u16)0x3000)            /* ETPS[1:0] bits (External trigger prescaler) */
#define  TIM_SMCR_ETPS_0                     ((u16)0x1000)            /* Bit 0 */
#define  TIM_SMCR_ETPS_1                     ((u16)0x2000)            /* Bit 1 */

#define  TIM_SMCR_ECE                        ((u16)0x4000)            /* External clock enable */
#define  TIM_SMCR_ETP                        ((u16)0x8000)            /* External trigger polarity */


/*******************  Bit definition for TIM_DIER register  *******************/
#define  TIM_DIER_UIE                        ((u16)0x0001)            /* Update interrupt enable */
#define  TIM_DIER_CC1IE                      ((u16)0x0002)            /* Capture/Compare 1 interrupt enable */
#define  TIM_DIER_CC2IE                      ((u16)0x0004)            /* Capture/Compare 2 interrupt enable */
#define  TIM_DIER_CC3IE                      ((u16)0x0008)            /* Capture/Compare 3 interrupt enable */
#define  TIM_DIER_CC4IE                      ((u16)0x0010)            /* Capture/Compare 4 interrupt enable */
#define  TIM_DIER_COMIE                      ((u16)0x0020)            /* COM interrupt enable */
#define  TIM_DIER_TIE                        ((u16)0x0040)            /* Trigger interrupt enable */
#define  TIM_DIER_BIE                        ((u16)0x0080)            /* Break interrupt enable */
#define  TIM_DIER_UDE                        ((u16)0x0100)            /* Update DMA request enable */
#define  TIM_DIER_CC1DE                      ((u16)0x0200)            /* Capture/Compare 1 DMA request enable */
#define  TIM_DIER_CC2DE                      ((u16)0x0400)            /* Capture/Compare 2 DMA request enable */
#define  TIM_DIER_CC3DE                      ((u16)0x0800)            /* Capture/Compare 3 DMA request enable */
#define  TIM_DIER_CC4DE                      ((u16)0x1000)            /* Capture/Compare 4 DMA request enable */
#define  TIM_DIER_COMDE                      ((u16)0x2000)            /* COM DMA request enable */
#define  TIM_DIER_TDE                        ((u16)0x4000)            /* Trigger DMA request enable */


/********************  Bit definition for TIM_SR register  ********************/
#define  TIM_SR_UIF                          ((u16)0x0001)            /* Update interrupt Flag */
#define  TIM_SR_CC1IF                        ((u16)0x0002)            /* Capture/Compare 1 interrupt Flag */
#define  TIM_SR_CC2IF                        ((u16)0x0004)            /* Capture/Compare 2 interrupt Flag */
#define  TIM_SR_CC3IF                        ((u16)0x0008)            /* Capture/Compare 3 interrupt Flag */
#define  TIM_SR_CC4IF                        ((u16)0x0010)            /* Capture/Compare 4 interrupt Flag */
#define  TIM_SR_COMIF                        ((u16)0x0020)            /* COM interrupt Flag */
#define  TIM_SR_TIF                          ((u16)0x0040)            /* Trigger interrupt Flag */
#define  TIM_SR_BIF                          ((u16)0x0080)            /* Break interrupt Flag */
#define  TIM_SR_CC1OF                        ((u16)0x0200)            /* Capture/Compare 1 Overcapture Flag */
#define  TIM_SR_CC2OF                        ((u16)0x0400)            /* Capture/Compare 2 Overcapture Flag */
#define  TIM_SR_CC3OF                        ((u16)0x0800)            /* Capture/Compare 3 Overcapture Flag */
#define  TIM_SR_CC4OF                        ((u16)0x1000)            /* Capture/Compare 4 Overcapture Flag */


/*******************  Bit definition for TIM_EGR register  ********************/
#define  TIM_EGR_UG                          ((u8)0x01)               /* Update Generation */
#define  TIM_EGR_CC1G                        ((u8)0x02)               /* Capture/Compare 1 Generation */
#define  TIM_EGR_CC2G                        ((u8)0x04)               /* Capture/Compare 2 Generation */
#define  TIM_EGR_CC3G                        ((u8)0x08)               /* Capture/Compare 3 Generation */
#define  TIM_EGR_CC4G                        ((u8)0x10)               /* Capture/Compare 4 Generation */
#define  TIM_EGR_COMG                        ((u8)0x20)               /* Capture/Compare Control Update Generation */
#define  TIM_EGR_TG                          ((u8)0x40)               /* Trigger Generation */
#define  TIM_EGR_BG                          ((u8)0x80)               /* Break Generation */


