steup/contiki/cpu/arm/atsam3s4/ATSAM3S4_map.h
#define  FSMC_BCR1_MWID                      ((u32)0x00000030)        /* MWID[1:0] bits (Memory data bus width) */
#define  FSMC_BCR1_MWID_0                    ((u32)0x00000010)        /* Bit 0 */
#define  FSMC_BCR1_MWID_1                    ((u32)0x00000020)        /* Bit 1 */

#define  FSMC_BCR1_FACCEN                    ((u32)0x00000040)        /* Flash access enable */
#define  FSMC_BCR1_BURSTEN                   ((u32)0x00000100)        /* Burst enable bit */
#define  FSMC_BCR1_WAITPOL                   ((u32)0x00000200)        /* Wait signal polarity bit */
#define  FSMC_BCR1_WRAPMOD                   ((u32)0x00000400)        /* Wrapped burst mode support */
#define  FSMC_BCR1_WAITCFG                   ((u32)0x00000800)        /* Wait timing configuration */
#define  FSMC_BCR1_WREN                      ((u32)0x00001000)        /* Write enable bit */
#define  FSMC_BCR1_WAITEN                    ((u32)0x00002000)        /* Wait enable bit */
#define  FSMC_BCR1_EXTMOD                    ((u32)0x00004000)        /* Extended mode enable */
#define  FSMC_BCR1_CBURSTRW                  ((u32)0x00080000)        /* Write burst enable */


/******************  Bit definition for FSMC_BCR2 register  *******************/
#define  FSMC_BCR2_MBKEN                     ((u32)0x00000001)        /* Memory bank enable bit */
#define  FSMC_BCR2_MUXEN                     ((u32)0x00000002)        /* Address/data multiplexing enable bit */

#define  FSMC_BCR2_MTYP                      ((u32)0x0000000C)        /* MTYP[1:0] bits (Memory type) */
#define  FSMC_BCR2_MTYP_0                    ((u32)0x00000004)        /* Bit 0 */
#define  FSMC_BCR2_MTYP_1                    ((u32)0x00000008)        /* Bit 1 */

#define  FSMC_BCR2_MWID                      ((u32)0x00000030)        /* MWID[1:0] bits (Memory data bus width) */
#define  FSMC_BCR2_MWID_0                    ((u32)0x00000010)        /* Bit 0 */
#define  FSMC_BCR2_MWID_1                    ((u32)0x00000020)        /* Bit 1 */

#define  FSMC_BCR2_FACCEN                    ((u32)0x00000040)        /* Flash access enable */
#define  FSMC_BCR2_BURSTEN                   ((u32)0x00000100)        /* Burst enable bit */
#define  FSMC_BCR2_WAITPOL                   ((u32)0x00000200)        /* Wait signal polarity bit */
#define  FSMC_BCR2_WRAPMOD                   ((u32)0x00000400)        /* Wrapped burst mode support */
#define  FSMC_BCR2_WAITCFG                   ((u32)0x00000800)        /* Wait timing configuration */
#define  FSMC_BCR2_WREN                      ((u32)0x00001000)        /* Write enable bit */
#define  FSMC_BCR2_WAITEN                    ((u32)0x00002000)        /* Wait enable bit */
#define  FSMC_BCR2_EXTMOD                    ((u32)0x00004000)        /* Extended mode enable */
#define  FSMC_BCR2_CBURSTRW                  ((u32)0x00080000)        /* Write burst enable */


/******************  Bit definition for FSMC_BCR3 register  *******************/
#define  FSMC_BCR3_MBKEN                     ((u32)0x00000001)        /* Memory bank enable bit */
#define  FSMC_BCR3_MUXEN                     ((u32)0x00000002)        /* Address/data multiplexing enable bit */

#define  FSMC_BCR3_MTYP                      ((u32)0x0000000C)        /* MTYP[1:0] bits (Memory type) */
#define  FSMC_BCR3_MTYP_0                    ((u32)0x00000004)        /* Bit 0 */
#define  FSMC_BCR3_MTYP_1                    ((u32)0x00000008)        /* Bit 1 */

#define  FSMC_BCR3_MWID                      ((u32)0x00000030)        /* MWID[1:0] bits (Memory data bus width) */
#define  FSMC_BCR3_MWID_0                    ((u32)0x00000010)        /* Bit 0 */
#define  FSMC_BCR3_MWID_1                    ((u32)0x00000020)        /* Bit 1 */

#define  FSMC_BCR3_FACCEN                    ((u32)0x00000040)        /* Flash access enable */
#define  FSMC_BCR3_BURSTEN                   ((u32)0x00000100)        /* Burst enable bit */
#define  FSMC_BCR3_WAITPOL                   ((u32)0x00000200)        /* Wait signal polarity bit. */
#define  FSMC_BCR3_WRAPMOD                   ((u32)0x00000400)        /* Wrapped burst mode support */
#define  FSMC_BCR3_WAITCFG                   ((u32)0x00000800)        /* Wait timing configuration */
#define  FSMC_BCR3_WREN                      ((u32)0x00001000)        /* Write enable bit */
#define  FSMC_BCR3_WAITEN                    ((u32)0x00002000)        /* Wait enable bit */
#define  FSMC_BCR3_EXTMOD                    ((u32)0x00004000)        /* Extended mode enable */
#define  FSMC_BCR3_CBURSTRW                  ((u32)0x00080000)        /* Write burst enable */


/******************  Bit definition for FSMC_BCR4 register  *******************/
#define  FSMC_BCR4_MBKEN                     ((u32)0x00000001)        /* Memory bank enable bit */
#define  FSMC_BCR4_MUXEN                     ((u32)0x00000002)        /* Address/data multiplexing enable bit */

#define  FSMC_BCR4_MTYP                      ((u32)0x0000000C)        /* MTYP[1:0] bits (Memory type) */
#define  FSMC_BCR4_MTYP_0                    ((u32)0x00000004)        /* Bit 0 */
#define  FSMC_BCR4_MTYP_1                    ((u32)0x00000008)        /* Bit 1 */

#define  FSMC_BCR4_MWID                      ((u32)0x00000030)        /* MWID[1:0] bits (Memory data bus width) */
#define  FSMC_BCR4_MWID_0                    ((u32)0x00000010)        /* Bit 0 */
#define  FSMC_BCR4_MWID_1                    ((u32)0x00000020)        /* Bit 1 */

#define  FSMC_BCR4_FACCEN                    ((u32)0x00000040)        /* Flash access enable */
#define  FSMC_BCR4_BURSTEN                   ((u32)0x00000100)        /* Burst enable bit */
#define  FSMC_BCR4_WAITPOL                   ((u32)0x00000200)        /* Wait signal polarity bit */
#define  FSMC_BCR4_WRAPMOD                   ((u32)0x00000400)        /* Wrapped burst mode support */
#define  FSMC_BCR4_WAITCFG                   ((u32)0x00000800)        /* Wait timing configuration */
#define  FSMC_BCR4_WREN                      ((u32)0x00001000)        /* Write enable bit */
#define  FSMC_BCR4_WAITEN                    ((u32)0x00002000)        /* Wait enable bit */
#define  FSMC_BCR4_EXTMOD                    ((u32)0x00004000)        /* Extended mode enable */
#define  FSMC_BCR4_CBURSTRW                  ((u32)0x00080000)        /* Write burst enable */


/******************  Bit definition for FSMC_BTR1 register  ******************/
#define  FSMC_BTR1_ADDSET                    ((u32)0x0000000F)        /* ADDSET[3:0] bits (Address setup phase duration) */
#define  FSMC_BTR1_ADDSET_0                  ((u32)0x00000001)        /* Bit 0 */
#define  FSMC_BTR1_ADDSET_1                  ((u32)0x00000002)        /* Bit 1 */
#define  FSMC_BTR1_ADDSET_2                  ((u32)0x00000004)        /* Bit 2 */
#define  FSMC_BTR1_ADDSET_3                  ((u32)0x00000008)        /* Bit 3 */

#define  FSMC_BTR1_ADDHLD                    ((u32)0x000000F0)        /* ADDHLD[3:0] bits (Address-hold phase duration) */
#define  FSMC_BTR1_ADDHLD_0                  ((u32)0x00000010)        /* Bit 0 */
#define  FSMC_BTR1_ADDHLD_1                  ((u32)0x00000020)        /* Bit 1 */
#define  FSMC_BTR1_ADDHLD_2                  ((u32)0x00000040)        /* Bit 2 */
#define  FSMC_BTR1_ADDHLD_3                  ((u32)0x00000080)        /* Bit 3 */

#define  FSMC_BTR1_DATAST                    ((u32)0x0000FF00)        /* DATAST [3:0] bits (Data-phase duration) */
#define  FSMC_BTR1_DATAST_0                  ((u32)0x00000100)        /* Bit 0 */
#define  FSMC_BTR1_DATAST_1                  ((u32)0x00000200)        /* Bit 1 */
#define  FSMC_BTR1_DATAST_2                  ((u32)0x00000400)        /* Bit 2 */
#define  FSMC_BTR1_DATAST_3                  ((u32)0x00000800)        /* Bit 3 */

