steup/contiki/cpu/arm/atsam3s4/ATSAM3S4_map.h
#define  USB_EP0R_DTOG_RX                    ((u16)0x4000)            /* Data Toggle, for reception transfers */
#define  USB_EP0R_CTR_RX                     ((u16)0x8000)            /* Correct Transfer for reception */


/*******************  Bit definition for USB_EP1R register  *******************/
#define  USB_EP1R_EA                         ((u16)0x000F)            /* Endpoint Address */

#define  USB_EP1R_STAT_TX                    ((u16)0x0030)            /* STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EP1R_STAT_TX_0                  ((u16)0x0010)            /* Bit 0 */
#define  USB_EP1R_STAT_TX_1                  ((u16)0x0020)            /* Bit 1 */

#define  USB_EP1R_DTOG_TX                    ((u16)0x0040)            /* Data Toggle, for transmission transfers */
#define  USB_EP1R_CTR_TX                     ((u16)0x0080)            /* Correct Transfer for transmission */
#define  USB_EP1R_EP_KIND                    ((u16)0x0100)            /* Endpoint Kind */

#define  USB_EP1R_EP_TYPE                    ((u16)0x0600)            /* EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EP1R_EP_TYPE_0                  ((u16)0x0200)            /* Bit 0 */
#define  USB_EP1R_EP_TYPE_1                  ((u16)0x0400)            /* Bit 1 */

#define  USB_EP1R_SETUP                      ((u16)0x0800)            /* Setup transaction completed */

#define  USB_EP1R_STAT_RX                    ((u16)0x3000)            /* STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EP1R_STAT_RX_0                  ((u16)0x1000)            /* Bit 0 */
#define  USB_EP1R_STAT_RX_1                  ((u16)0x2000)            /* Bit 1 */

#define  USB_EP1R_DTOG_RX                    ((u16)0x4000)            /* Data Toggle, for reception transfers */
#define  USB_EP1R_CTR_RX                     ((u16)0x8000)            /* Correct Transfer for reception */


/*******************  Bit definition for USB_EP2R register  *******************/
#define  USB_EP2R_EA                         ((u16)0x000F)            /* Endpoint Address */

#define  USB_EP2R_STAT_TX                    ((u16)0x0030)            /* STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EP2R_STAT_TX_0                  ((u16)0x0010)            /* Bit 0 */
#define  USB_EP2R_STAT_TX_1                  ((u16)0x0020)            /* Bit 1 */

#define  USB_EP2R_DTOG_TX                    ((u16)0x0040)            /* Data Toggle, for transmission transfers */
#define  USB_EP2R_CTR_TX                     ((u16)0x0080)            /* Correct Transfer for transmission */
#define  USB_EP2R_EP_KIND                    ((u16)0x0100)            /* Endpoint Kind */

#define  USB_EP2R_EP_TYPE                    ((u16)0x0600)            /* EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EP2R_EP_TYPE_0                  ((u16)0x0200)            /* Bit 0 */
#define  USB_EP2R_EP_TYPE_1                  ((u16)0x0400)            /* Bit 1 */

#define  USB_EP2R_SETUP                      ((u16)0x0800)            /* Setup transaction completed */

#define  USB_EP2R_STAT_RX                    ((u16)0x3000)            /* STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EP2R_STAT_RX_0                  ((u16)0x1000)            /* Bit 0 */
#define  USB_EP2R_STAT_RX_1                  ((u16)0x2000)            /* Bit 1 */

#define  USB_EP2R_DTOG_RX                    ((u16)0x4000)            /* Data Toggle, for reception transfers */
#define  USB_EP2R_CTR_RX                     ((u16)0x8000)            /* Correct Transfer for reception */


/*******************  Bit definition for USB_EP3R register  *******************/
#define  USB_EP3R_EA                         ((u16)0x000F)            /* Endpoint Address */

#define  USB_EP3R_STAT_TX                    ((u16)0x0030)            /* STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EP3R_STAT_TX_0                  ((u16)0x0010)            /* Bit 0 */
#define  USB_EP3R_STAT_TX_1                  ((u16)0x0020)            /* Bit 1 */

#define  USB_EP3R_DTOG_TX                    ((u16)0x0040)            /* Data Toggle, for transmission transfers */
#define  USB_EP3R_CTR_TX                     ((u16)0x0080)            /* Correct Transfer for transmission */
#define  USB_EP3R_EP_KIND                    ((u16)0x0100)            /* Endpoint Kind */

#define  USB_EP3R_EP_TYPE                    ((u16)0x0600)            /* EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EP3R_EP_TYPE_0                  ((u16)0x0200)            /* Bit 0 */
#define  USB_EP3R_EP_TYPE_1                  ((u16)0x0400)            /* Bit 1 */

#define  USB_EP3R_SETUP                      ((u16)0x0800)            /* Setup transaction completed */

#define  USB_EP3R_STAT_RX                    ((u16)0x3000)            /* STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EP3R_STAT_RX_0                  ((u16)0x1000)            /* Bit 0 */
#define  USB_EP3R_STAT_RX_1                  ((u16)0x2000)            /* Bit 1 */

#define  USB_EP3R_DTOG_RX                    ((u16)0x4000)            /* Data Toggle, for reception transfers */
#define  USB_EP3R_CTR_RX                     ((u16)0x8000)            /* Correct Transfer for reception */


/*******************  Bit definition for USB_EP4R register  *******************/
#define  USB_EP4R_EA                         ((u16)0x000F)            /* Endpoint Address */

#define  USB_EP4R_STAT_TX                    ((u16)0x0030)            /* STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EP4R_STAT_TX_0                  ((u16)0x0010)            /* Bit 0 */
#define  USB_EP4R_STAT_TX_1                  ((u16)0x0020)            /* Bit 1 */

#define  USB_EP4R_DTOG_TX                    ((u16)0x0040)            /* Data Toggle, for transmission transfers */
#define  USB_EP4R_CTR_TX                     ((u16)0x0080)            /* Correct Transfer for transmission */
#define  USB_EP4R_EP_KIND                    ((u16)0x0100)            /* Endpoint Kind */

#define  USB_EP4R_EP_TYPE                    ((u16)0x0600)            /* EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EP4R_EP_TYPE_0                  ((u16)0x0200)            /* Bit 0 */
#define  USB_EP4R_EP_TYPE_1                  ((u16)0x0400)            /* Bit 1 */

#define  USB_EP4R_SETUP                      ((u16)0x0800)            /* Setup transaction completed */

#define  USB_EP4R_STAT_RX                    ((u16)0x3000)            /* STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EP4R_STAT_RX_0                  ((u16)0x1000)            /* Bit 0 */
#define  USB_EP4R_STAT_RX_1                  ((u16)0x2000)            /* Bit 1 */

#define  USB_EP4R_DTOG_RX                    ((u16)0x4000)            /* Data Toggle, for reception transfers */
#define  USB_EP4R_CTR_RX                     ((u16)0x8000)            /* Correct Transfer for reception */


/*******************  Bit definition for USB_EP5R register  *******************/
#define  USB_EP5R_EA                         ((u16)0x000F)            /* Endpoint Address */

#define  USB_EP5R_STAT_TX                    ((u16)0x0030)            /* STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EP5R_STAT_TX_0                  ((u16)0x0010)            /* Bit 0 */
#define  USB_EP5R_STAT_TX_1                  ((u16)0x0020)            /* Bit 1 */

#define  USB_EP5R_DTOG_TX                    ((u16)0x0040)            /* Data Toggle, for transmission transfers */
#define  USB_EP5R_CTR_TX                     ((u16)0x0080)            /* Correct Transfer for transmission */
#define  USB_EP5R_EP_KIND                    ((u16)0x0100)            /* Endpoint Kind */

