steup/contiki/cpu/arm/atsam3s4/ATSAM3S4_map.h
#define  USB_EP5R_EP_TYPE                    ((u16)0x0600)            /* EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EP5R_EP_TYPE_0                  ((u16)0x0200)            /* Bit 0 */
#define  USB_EP5R_EP_TYPE_1                  ((u16)0x0400)            /* Bit 1 */

#define  USB_EP5R_SETUP                      ((u16)0x0800)            /* Setup transaction completed */

#define  USB_EP5R_STAT_RX                    ((u16)0x3000)            /* STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EP5R_STAT_RX_0                  ((u16)0x1000)            /* Bit 0 */
#define  USB_EP5R_STAT_RX_1                  ((u16)0x2000)            /* Bit 1 */

#define  USB_EP5R_DTOG_RX                    ((u16)0x4000)            /* Data Toggle, for reception transfers */
#define  USB_EP5R_CTR_RX                     ((u16)0x8000)            /* Correct Transfer for reception */


/*******************  Bit definition for USB_EP6R register  *******************/
#define  USB_EP6R_EA                         ((u16)0x000F)            /* Endpoint Address */

#define  USB_EP6R_STAT_TX                    ((u16)0x0030)            /* STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EP6R_STAT_TX_0                  ((u16)0x0010)            /* Bit 0 */
#define  USB_EP6R_STAT_TX_1                  ((u16)0x0020)            /* Bit 1 */

#define  USB_EP6R_DTOG_TX                    ((u16)0x0040)            /* Data Toggle, for transmission transfers */
#define  USB_EP6R_CTR_TX                     ((u16)0x0080)            /* Correct Transfer for transmission */
#define  USB_EP6R_EP_KIND                    ((u16)0x0100)            /* Endpoint Kind */

#define  USB_EP6R_EP_TYPE                    ((u16)0x0600)            /* EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EP6R_EP_TYPE_0                  ((u16)0x0200)            /* Bit 0 */
#define  USB_EP6R_EP_TYPE_1                  ((u16)0x0400)            /* Bit 1 */

#define  USB_EP6R_SETUP                      ((u16)0x0800)            /* Setup transaction completed */

#define  USB_EP6R_STAT_RX                    ((u16)0x3000)            /* STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EP6R_STAT_RX_0                  ((u16)0x1000)            /* Bit 0 */
#define  USB_EP6R_STAT_RX_1                  ((u16)0x2000)            /* Bit 1 */

#define  USB_EP6R_DTOG_RX                    ((u16)0x4000)            /* Data Toggle, for reception transfers */
#define  USB_EP6R_CTR_RX                     ((u16)0x8000)            /* Correct Transfer for reception */


/*******************  Bit definition for USB_EP7R register  *******************/
#define  USB_EP7R_EA                         ((u16)0x000F)            /* Endpoint Address */

#define  USB_EP7R_STAT_TX                    ((u16)0x0030)            /* STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EP7R_STAT_TX_0                  ((u16)0x0010)            /* Bit 0 */
#define  USB_EP7R_STAT_TX_1                  ((u16)0x0020)            /* Bit 1 */

#define  USB_EP7R_DTOG_TX                    ((u16)0x0040)            /* Data Toggle, for transmission transfers */
#define  USB_EP7R_CTR_TX                     ((u16)0x0080)            /* Correct Transfer for transmission */
#define  USB_EP7R_EP_KIND                    ((u16)0x0100)            /* Endpoint Kind */

#define  USB_EP7R_EP_TYPE                    ((u16)0x0600)            /* EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EP7R_EP_TYPE_0                  ((u16)0x0200)            /* Bit 0 */
#define  USB_EP7R_EP_TYPE_1                  ((u16)0x0400)            /* Bit 1 */

#define  USB_EP7R_SETUP                      ((u16)0x0800)            /* Setup transaction completed */

#define  USB_EP7R_STAT_RX                    ((u16)0x3000)            /* STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EP7R_STAT_RX_0                  ((u16)0x1000)            /* Bit 0 */
#define  USB_EP7R_STAT_RX_1                  ((u16)0x2000)            /* Bit 1 */

#define  USB_EP7R_DTOG_RX                    ((u16)0x4000)            /* Data Toggle, for reception transfers */
#define  USB_EP7R_CTR_RX                     ((u16)0x8000)            /* Correct Transfer for reception */


/* Common registers */
/*******************  Bit definition for USB_CNTR register  *******************/
#define  USB_CNTR_FRES                       ((u16)0x0001)            /* Force USB Reset */
#define  USB_CNTR_PDWN                       ((u16)0x0002)            /* Power down */
#define  USB_CNTR_LP_MODE                    ((u16)0x0004)            /* Low-power mode */
#define  USB_CNTR_FSUSP                      ((u16)0x0008)            /* Force suspend */
#define  USB_CNTR_RESUME                     ((u16)0x0010)            /* Resume request */
#define  USB_CNTR_ESOFM                      ((u16)0x0100)            /* Expected Start Of Frame Interrupt Mask */
#define  USB_CNTR_SOFM                       ((u16)0x0200)            /* Start Of Frame Interrupt Mask */
#define  USB_CNTR_RESETM                     ((u16)0x0400)            /* RESET Interrupt Mask */
#define  USB_CNTR_SUSPM                      ((u16)0x0800)            /* Suspend mode Interrupt Mask */
#define  USB_CNTR_WKUPM                      ((u16)0x1000)            /* Wakeup Interrupt Mask */
#define  USB_CNTR_ERRM                       ((u16)0x2000)            /* Error Interrupt Mask */
#define  USB_CNTR_PMAOVRM                    ((u16)0x4000)            /* Packet Memory Area Over / Underrun Interrupt Mask */
#define  USB_CNTR_CTRM                       ((u16)0x8000)            /* Correct Transfer Interrupt Mask */


/*******************  Bit definition for USB_ISTR register  *******************/
#define  USB_ISTR_EP_ID                      ((u16)0x000F)            /* Endpoint Identifier */
#define  USB_ISTR_DIR                        ((u16)0x0010)            /* Direction of transaction */
#define  USB_ISTR_ESOF                       ((u16)0x0100)            /* Expected Start Of Frame */
#define  USB_ISTR_SOF                        ((u16)0x0200)            /* Start Of Frame */
#define  USB_ISTR_RESET                      ((u16)0x0400)            /* USB RESET request */
#define  USB_ISTR_SUSP                       ((u16)0x0800)            /* Suspend mode request */
#define  USB_ISTR_WKUP                       ((u16)0x1000)            /* Wake up */
#define  USB_ISTR_ERR                        ((u16)0x2000)            /* Error */
#define  USB_ISTR_PMAOVR                     ((u16)0x4000)            /* Packet Memory Area Over / Underrun */
#define  USB_ISTR_CTR                        ((u16)0x8000)            /* Correct Transfer */


/*******************  Bit definition for USB_FNR register  ********************/
#define  USB_FNR_FN                          ((u16)0x07FF)            /* Frame Number */
#define  USB_FNR_LSOF                        ((u16)0x1800)            /* Lost SOF */
#define  USB_FNR_LCK                         ((u16)0x2000)            /* Locked */
#define  USB_FNR_RXDM                        ((u16)0x4000)            /* Receive Data - Line Status */
#define  USB_FNR_RXDP                        ((u16)0x8000)            /* Receive Data + Line Status */


